import re

# Функция для удаления дат из текста
def remove_dates(text):
    pattern = r'''
        с\s*\(?\d{2}\.\d{2}\.\d{2,4}\s*по\s*\(?\d{2}\.\d{2}\.\d{2,4}\)?|  # "с <дата> по <дата>"
        \(с\s*\d{2}\.\d{2}\.\d{2,4}\s*-\s*\d{2}\.\d{2}\.\d{2,4}\)|        # "(с <дата>-<дата>)"
        с\s*\(?\s*\d{2}\.\d{2}\.\d{2,4}\s*-\s*\d{2}\.\d{2}\.\d{2,4}\s*\)?| # "с (<дата>-<дата>)"
        \s*\(\s*\)|                                                        # "()" без содержания
        \d{2}\.\d{2}\.\d{2,4}                                             # "<дата>"
    '''
    return re.sub(pattern, '', text, flags=re.VERBOSE).strip()  # Удаление совпадений с паттерном